[
      {
        "id": 1,
        "title": "Rebranding, Rebuilding, and Vibing Through the Boredom",
        "slug": "rebranding-and-vibing",
        "date": "2025-07-05",
        "excerpt": "After wrapping up my last job, I found myself with free time, a restless brain, and a deep urge to build something — so I rebranded my personal site and decided to write again.",
        "content": "# Rebranding, Rebuilding, and Vibing Through the Boredom\n\nThis week, I’ve been bored.\n\nNot the “nothing to do” kind of bored — more the quiet restlessness that creeps in when you’ve been going nonstop for years and your brain suddenly hits… free time.\n\n**Monday was my last day at work**, and I’m now in that liminal space — not yet in the next thing, no longer in the old one. For the past few years, especially since I officially entered the formal job market, I’ve been constantly grinding. I barely took leave until this last festive season. And in the last three months, I was working at the office almost full-time, constantly around people.\n\nNow it’s quiet. And my brain doesn’t really know what to do with that.\n\nSo I started building again.\n\nI dusted off my old personal site — something I originally created as an experiment back when I was still figuring out how Netlify even worked — and just started coding for the sake of it. No plan. No roadmap. Just code and vibes.\n\nThat evolved into a spontaneous rebrand. I started thinking more deeply about how I present myself online, how I share what I’ve learned over the years, and how I carve out space for the version of me that’s still evolving.\n\n## Why Now?\n\nMaybe it’s boredom. Maybe it’s clarity. Maybe it’s just time.\n\nWhatever the reason, I’m finally putting energy into something that helps me reflect, showcase my skills, and reconnect with the creative parts of engineering I’ve always loved.\n\nI’m not new to blogging. I used to write on a blog called **Thoughts and Observations**, but that disappeared when the platform (Revue) shut down. I didn’t migrate anything because, honestly, I just felt lazy. But I’ve missed writing. Not the polished performance kind — the real kind. The \"this is what’s in my head today\" kind.\n\n## A Snapshot Worth Sharing\n\nThe image you see at the top of this post? One of the best photos I’ve ever taken. There's more where that came from — eventually. I'm not rushing anything. I'm just showing up when it feels right.\n\n## No Socials, More Sanity\n\nI’ve been on a long-standing social media hiatus. That wasn’t accidental. It’s helped me think more clearly, feel less noise, and be more present — especially now that I’m in this transition.\n\nI’ll probably write about that more soon. For now, just know: this space is where I’m pouring my thoughts, ideas, code, and curiosities.\n\n## What to Expect\n\n- Technical deep dives  \n- Honest takes on software, systems, and sanity  \n- Reflections from a mind adjusting to silence  \n- Maybe even a few rants and personal notes\n\nIf you’re into backend engineering, distributed systems, or just want to follow along as I figure out what’s next — welcome.\n\nLet’s see where this goes.",
        "coverImage": "/src/assets/images/post1.JPG"

      }
      
]
