[
      {
        "id": 1,
        "title": "Rebranding, Rebuilding, and Vibing Through the Boredom",
        "slug": "rebranding-and-vibing",
        "date": "2025-07-05",
        "excerpt": "After wrapping up my last job, I found myself with free time, a restless brain, and a deep urge to build something — so I rebranded my personal site and decided to write again.",
        "content": "# Rebranding, Rebuilding, and Vibing Through the Boredom\n\nThis week, I’ve been bored.\n\nNot the “nothing to do” kind of bored — more the quiet restlessness that creeps in when you’ve been going nonstop for years and your brain suddenly hits… free time.\n\n**Monday was my last day at work**, and I'm now in that liminal space — not yet in the next thing, no longer in the old one. For the past few years, especially since I officially entered the formal job market, I’ve been constantly grinding. I barely took leave until this last festive season. And in the last three months, I was working at the office almost full-time, constantly around people.\n\nNow it’s quiet. And my brain doesn’t really know what to do with that.\n\nSo I started building again.\n\nI dusted off my old personal site — something I originally created as an experiment back when I was still figuring out how Netlify even worked — and just started coding for the sake of it. No plan. No roadmap. Just code and vibes.\n\nThat evolved into a spontaneous rebrand. I started thinking more deeply about how I present myself online, how I share what I’ve learned over the years, and how I carve out space for the version of me that’s still evolving.\n\n## Why Now?\n\nMaybe it’s boredom. Maybe it’s clarity. Maybe it’s just time.\n\nWhatever the reason, I’m finally putting energy into something that helps me reflect, showcase my skills, and reconnect with the creative parts of engineering I’ve always loved.\n\nI’m not new to blogging. I used to write on a blog called **Thoughts and Observations**, but that disappeared when the platform (Revue) shut down. I didn’t migrate anything because, honestly, I just felt lazy. But I’ve missed writing. Not the polished performance kind — the real kind. The \"this is what’s in my head today\" kind.\n\n## A Snapshot Worth Sharing\n\nThe image you see at the top of this post? One of the best photos I’ve ever taken. There's more where that came from — eventually. I'm not rushing anything. I'm just showing up when it feels right.\n\n## No Socials, More Sanity\n\nI’ve been on a long-standing social media hiatus. That wasn’t accidental. It’s helped me think more clearly, feel less noise, and be more present — especially now that I’m in this transition.\n\nI’ll probably write about that more soon. For now, just know: this space is where I’m pouring my thoughts, ideas, code, and curiosities.\n\n## What to Expect\n\n- Technical deep dives  \n- Honest takes on software, systems, and sanity  \n- Reflections from a mind adjusting to silence  \n- Maybe even a few rants and personal notes\n\nIf you’re into backend engineering, distributed systems, or just want to follow along as I figure out what’s next — welcome.\n\nLet’s see where this goes.",
        "coverImage": "/src/assets/images/post1.JPG"

      },
      {
        "id": 2,
        "title": "Silence, Statuses, and the Strange Weight of Digital Presence",
        "slug": "digital-presence-vs-value",
        "date": "2025-07-16",
        "excerpt": "After 16 days without daily standups or real engagement, I’m reflecting on fake connections, digital noise, and what value actually looks like.",
        "content": "# Silence, Statuses, and the Strange Weight of Digital Presence\n\nIt’s the 16th today — and it’s been **16 days without a stand-up**, without teammates, and with very little real engagement. I recently wrapped up my previous role and have done a couple of interviews since, but for the most part, I’m in that strange in-between: not quite transitioning yet, but also no longer in motion. It’s quiet.  \nThe photo above? I took it earlier this year, just after driving through the Magoebaskloof mountain pass. One of those still moments that matched the mood of this post perfectly.\n\nOne company finally got back to me after nearly a month of silence — only to say there’s another candidate further in the process who seems like a better fit. To be honest, that stung a little. Not just because of the outcome, but because I could tell that the HR call was less about me and more about reaching a certain “candidate cap.” A box ticked. Still, I kept my composure. I politely said I was open to future opportunities. Some days, emotional intelligence is the only professionalism you can afford.\n\n## Early Lessons in People\n\nI learned a lot about people long before adulthood — probably earlier than I should have. My family went through real ups and downs, and those seasons taught me how to read individuals without needing anyone to explain the game to me.\n\nSome might mistake that for being judgmental. But here's the thing: **we’re all allowed to form perceptions based on what we observe**. What matters is what we do with those perceptions *after* we get to know someone. If you refuse to update your view of someone even after learning who they truly are, that’s not gut instinct anymore — that’s just rigid judgment. There’s a line, and most people blur it.\n\nFrom my experience, I saw it firsthand. People who were always around — braais, gatherings, good times — but when things got rough? Gone. Not only that, some of them even had the audacity to ask for help later, as if they hadn’t disappeared when we needed them.\n\nThat contrast stuck with me. I started seeing the same pattern in friendships too. You’d have all-rounder friends — the ones who show up for everything — and then a thousand “purpose-specific” people: the fun friends, the work besties, the convenience connections.\n\nAnd some people? They only come closer when there’s something you can offer them — whether that’s knowledge, connections, clout, or comfort. Like moths to a flame, but only while it’s burning. The moment the light dims, they disappear, off to the next glow.\n\nAnd this wasn’t a lesson I learned in my twenties. I understood this stuff clearly by the time I was ten. That awareness hasn’t made me cynical, but it has made me deliberate. I don’t mistake presence for loyalty. I don’t confuse visibility for value.\n\n## Connections That Don’t Connect\n\nI’m fortunate to be connected with a few respected professionals — businessmen, scholars, even former ministers. But when it really comes down to it, I’ve been asking myself: **how many of them could I actually reach out to in a moment of need?**\n\nAnd beyond that — **what’s the cost of maintaining real, valuable relationships with people at that level?** There’s a delicate balance between misusing someone’s name to gain an unfair advantage, and genuinely reaching out to say, *“Can you vouch for me to at least get through the door?”* — knowing full well that what happens next is still on me.\n\nIt’s one of those grey areas people don’t really talk about. You can know the right people. You can even be in the same room. But if the relationship isn’t nurtured or built on mutual value, you’re just a name in a long contact list. And that’s not connection. That’s decoration.\n\nThat’s one of the reasons I stopped interacting on LinkedIn altogether. My profile lives in hibernation mode — I only activate it when I’m job hunting. I’m not trying to grow an audience or build some mythical “personal brand.” My digital presence is just another resume, and honestly, it doesn’t even scratch 1% of who I am or what I’m capable of.\n\n## Recognition Isn’t the Goal\n\nI’ve noticed how some people post almost every day — and yet, they still face the same challenges as those whose content gets little to no interaction. That’s when it hit me: **interaction without action is just distraction**. It creates the illusion of movement, but not real progress. And most of the people engaging? They’re not invested — just scrolling.\n\nThere’s something strange about the digital world rewarding *activity* over *impact*. Recently, I saw five different accounts being praised for sharing outdated and incorrect info — claiming AWS was offering free certification exams, months after that promo had ended. Only a handful, against tens of thousands, called out the misinformation. Not one person in the comments questioned it. It was just likes, fire emojis, and “thanks for sharing.”\n\nThat moment stuck with me. We’ve reached a point where **most people don’t pause long enough to process one thing before being flooded by five more**. Facts barely matter anymore. Metrics do. Attention becomes currency, even if it's built on fluff or falsehoods.\n\nI’m not wired for that kind of game. I don’t need recognition to validate my work. Would it be nice? Sure. But what really satisfies me is seeing something I’ve contributed to *actually working* out in the world — quietly doing its job.\n\nThat’s real. That’s enough for me.\n\n## No Socials, More Sanity\n\nThere’s something freeing about not constantly being pulled into timelines, trends, and opinions that don’t align with where I am mentally or emotionally.\n\nIf I could shape an ideal space, it would have dedicated audiences based on their interests — really taken into consideration — unlike how we select preferences on platforms like X or Instagram but still get flooded with noise.\n\nIt would also limit how much content someone consumes over a given period, factoring in not just quantity but substance. With sentiment analysis, it could help flag when content is becoming emotionally overwhelming — not to censor, but to protect. Add to that a layer of personality awareness — tuning the experience to how different people process emotion, motivation, and connection — and suddenly you're not just consuming content… you're in a space *designed with you in mind*.\n\nTo be honest, this might be something I take seriously — a real product, not just a thought experiment. Maybe it’s my way back into the founder zone.\n\nWhen it comes to people, I’ve come to value **depth over reach**. I’d rather have five solid, reliable connections I can truly build with than be surrounded by a crowd that’s only loosely present. These days, **alignment matters more than attention** — and peace matters more than performance.\n\n## Just Thinking Out Loud\n\nThis post isn’t a rant. It’s just me thinking out loud while I navigate this quiet middle space. Waiting. Reflecting. Rebuilding.\n\nSomewhere in the silence, there’s something solid forming. I’ll know it when I see it.\n\n— One for the geeks coming next.",
        "coverImage": "/src/assets/images/post2.JPG"
      }
         
]
